<?php

return [

  'valid' => [
    'max190' => 'Не более 190 символов',
    'max250' => 'Не более 250 символов',
  ],

  'modules' => [
    'blog' => 'Блог статей',
  ],

  //display
  'title'        => 'Название',
  'name'         => 'Имя',
  'slug'         => 'Ссылка (формируется автоматически)',
  'lang'         => 'Язык',
  'show'         => 'Отображать',
  'edited'       => 'Изменен',
  'text_preview' => 'Предварительный текст',
  'text_full'    => 'Полный текст',

  'all'     => 'Все записи',
  'deleted' => 'Удаленные',
  'drafted' => 'Черновики',

  'edit' => [
    'lang_site'    => 'Язык сайта',
    'category'     => 'Категория',
    'published_at' => 'Показывать с...',
    'published_to' => 'Показывать до...',

    'creators'   => 'Создал',
    'created_at' => 'Создано',
    'editors'    => 'Редактировал',
    'updated_at' => 'Редакция',

    'meta_title'       => 'Meta заголовок',
    'meta_description' => 'Meta описание',
    'actived'          => 'Включить на сайте',

    'icon'  => 'Значек (из иконок SVG)',
    'image' => 'Изображение',
  ],

];
