<?php

return [

  'main' => 'Вернуться на главную',
  'back' => 'Вернуться назад',

  '400t'   => 'Ошибка 400',
  '400'   => 'Запрос не может быть исполнен в виду синтаксической ошибки',

  '401t'   => 'Ошибка 401',
  '401'   => 'Неправильные данные авторизации',

  '403t'   => 'Ошибка 403',
  '403'   => 'Доступ к данному ресурсу ограничен',

  '404t'   => 'Ошибка 404',
  '404'   => 'Запрошенный ресурс не может быть найден',

  '405t'   => 'Ошибка 405',
  '405'   => 'Метод, при помощи которого совершается запрос к ресурсу, не доступен',

  '408t'   => 'Ошибка 408',
  '408'   => 'Время ожидания сервером передачи от клиента истекло',

  '409t'   => 'Ошибка 409',
  '409'   => 'Запрос не может быть выполнен из-за конфликтного обращения к ресурсу',

  '419t'   => 'Ошибка 419',
  '419'   => 'Срок действия сессии истек. Обновите и повторите попытку',

  '422t'   => 'Ошибка 422',
  '422'   => 'Запрос был принят и понят, но не может быть выполнен ввиду наличия семантических ошибок',

  '423t'   => 'Ошибка 423',
  '423'   => 'Целевой ресурс из запроса заблокирован от применения к нему указанного метода',

  '429t'   => 'Ошибка 429', //throttle
  '429'   => 'Слишком много попыток обращения. Повторите через пару минут',

  '451t'   => 'Ошибка 451',
  '451'   => 'Доступ к запрашиваемому ресурсу был заблокирован из юридических соображений',


  '500t' => 'Ошибка 500',
  '500' => 'Внутренняя ошибка сервера',

  '501t' => 'Ошибка почты',
  // '501' => 'Почтовый ящик не действителен.',
  '501' => 'Проверьте правильность написания почтового ящика или используйте другой',

  '502t' => 'Ошибка 502',
  '502' => 'Ошибка перенаправления',

  '503t' => 'Ошибка 503',
  '503' => 'Сервер временно недоступен',

  '504t' => 'Ошибка 504',
  '504' => 'Сервер не дождался ответа',

  '521t' => 'Сервис в процессе обновления',
  '521' => 'Сервис находится в процессе обновления и временно недоступен. Приносим извинения за доставленные неудобства',

  '524t' => 'Тайм-аут запроса',
  '524' => 'Подключение с веб-сервером установлено, но он не ответил за установленное время ожидания соединения',

];
